================
scope resolution
================

Foo::bar

---

(program (scope_resolution_expression (identifier) (identifier)))

============
element reference
============

foo[bar]

---

(program (element_reference (identifier) (identifier)))

============
element reference with string
============

foo["bar"]

---

(program (element_reference (identifier) (string)))

============
element reference with symbol
============

foo[:bar]

---

(program (element_reference (identifier) (symbol)))

===============
vacuous literal
===============

()

---

(program)

===================
yield without value
===================

yield

---

(program (yield))

=====
yield
=====

yield foo

---

(program (yield (identifier)))

===
not
===

not foo

---

(program (not (identifier)))

===
and
===

foo and bar

---

(program (and (identifier) (identifier)))

===
or
===

foo or bar

---

(program (or (identifier) (identifier)))

====================
and or associativity
====================

a or b and c

---

(program (and (or (identifier) (identifier)) (identifier)))

========
defined?
========

defined? foo

---

(program (defined (identifier)))

==========
assignment
==========

x = y

---

(program (assignment (identifier) (identifier)))

==========
math assignment
==========

x += y
x -= y
x *= y
x **= y
x /= y

---

(program
  (math_assignment (identifier) (identifier))
  (math_assignment (identifier) (identifier))
  (math_assignment (identifier) (identifier))
  (math_assignment (identifier) (identifier))
  (math_assignment (identifier) (identifier)))

==========
conditional assignment
==========

x ||= y
x &&= y

---

(program
  (conditional_assignment (identifier) (identifier))
  (conditional_assignment (identifier) (identifier)))

===========
conditional
===========

a ? b : c

---

(program (conditional (identifier) (identifier) (identifier)))

===============
inclusive range
===============

a..b

---

(program (range (identifier) (identifier)))

===============
exclusive range
===============

a...b

---

(program (range (identifier) (identifier)))

==========
boolean or
==========

a || b

---

(program (boolean_or (identifier) (identifier)))

===========
boolean and
===========

a && b

---

(program (boolean_and (identifier) (identifier)))

==========
relational
==========

a == b
a != b
a === b
a <=> b
a =~ b
a !~ b

---

(program
  (relational (identifier) (identifier))
  (relational (identifier) (identifier))
  (relational (identifier) (identifier))
  (relational (identifier) (identifier))
  (relational (identifier) (identifier))
  (relational (identifier) (identifier)))

==========
comparison
==========

a < b
a <= b
a > b
a >= b

---

(program
  (comparison (identifier) (identifier))
  (comparison (identifier) (identifier))
  (comparison (identifier) (identifier))
  (comparison (identifier) (identifier)))

==========
bitwise or
==========

a | b

---

(program (bitwise_or (identifier) (identifier)))

===========
bitwise xor
===========

a ^ b

---

(program (bitwise_or (identifier) (identifier)))

===========
bitwise and
===========

a & b

---

(program (bitwise_and (identifier) (identifier)))

=====
shift
=====

a >> b
a << b

---

(program
  (shift (identifier) (identifier))
  (shift (identifier) (identifier)))

========
additive
========

a + b

---

(program (additive (identifier) (identifier)))

==============
multiplicative
==============

a * b

---

(program (multiplicative (identifier) (identifier)))

===========
unary minus
===========

-a

---

(program (unary_minus (identifier)))

===========
exponential
===========

a ** b

---

(program (exponential (identifier) (identifier)))

==========
complement
==========

!a

---

(program (complement (identifier)))

===============================
function call
===============================

foo
foo()
print "hello"
print("hello")

---

(program
  (function_call (identifier) (argument_list))
  (function_call (identifier) (argument_list))
  (function_call (identifier) (argument_list (string)))
  (function_call (identifier) (argument_list (string))))

===============================
function call
===============================

foo.bar
foo.bar()
foo.bar "hi"
foo.bar "hi", 2
foo.bar("hi")
foo.bar("hi", 2)

---

(program
  (member_access (identifier) (identifier))
  (function_call (member_access (identifier) (identifier)) (argument_list))
  (function_call (member_access (identifier) (identifier)) (argument_list (string)))
  (function_call (member_access (identifier) (identifier)) (argument_list (string) (integer)))
  (function_call (member_access (identifier) (identifier)) (argument_list (string)))
  (function_call (member_access (identifier) (identifier)) (argument_list (string) (integer))))

============================
function call without parens
============================

include D::E.f

---

(program (function_call (identifier) (argument_list (member_access (scope_resolution_expression (identifier) (identifier)) (identifier)))))

==============
empty lambda expression
==============

lambda {}

---

(program (lambda_expression))

==================
lambda expression with body
==================

lambda { foo }

---

(program (lambda_expression (identifier)))

====================
lambda expression with an arg
====================

lambda { |foo| 1 }

---

(program (lambda_expression (formal_parameters (identifier)) (integer)))

===========================
lambda expression with multiple args
===========================

lambda { |a, b, c|
	1
	2
}

---

(program (lambda_expression (formal_parameters (identifier) (identifier) (identifier)) (integer) (integer)))
