================
scope resolution
================

Foo::bar
::Bar

---

(program
  (scope_resolution (identifier) (identifier))
  (scope_resolution (identifier)))

============
element reference
============

foo[bar]

---

(program (element_reference (identifier) (identifier)))

============
element reference with string
============

foo["bar"]

---

(program (element_reference (identifier) (string)))

============
element reference with symbol
============

foo[:bar]

---

(program (element_reference (identifier) (symbol)))

============
element assignment
============

foo[bar] = 1

---

(program (assignment (element_reference (identifier) (identifier)) (integer)))

===============
vacuous literal
===============

()

---

(program)

===================
yield without value
===================

yield

---

(program (yield))

=====
yield
=====

yield foo
yield foo, bar

---

(program
  (yield (argument_list (identifier)))
  (yield (argument_list (identifier) (identifier))))

===
not
===

not foo

---

(program (unary (identifier)))

===
and
===

foo and bar

---

(program (binary (identifier) (identifier)))

===
or
===

foo or bar

---

(program (binary (identifier) (identifier)))

====================
and or associativity
====================

a or b and c

---

(program (binary (binary (identifier) (identifier)) (identifier)))

========
defined?
========

defined? foo
defined? Foo.bar
defined?(foo)
defined?($foo)
defined?(@foo)

---

(program
  (unary (identifier))
  (unary (call (identifier) (identifier)))
  (unary (identifier))
  (unary (global_variable))
  (unary (instance_variable)))

==========
assignment
==========

x = y

---

(program (assignment (identifier) (identifier)))

==========
multiple assignment
==========

x, y = [1, 2]
x, * = [1, 2]
x, *args = [1, 2]

---

(program
  (assignment (left_assignment_list (identifier) (identifier)) (array (integer) (integer)))
  (assignment (left_assignment_list (identifier) (rest_assignment)) (array (integer) (integer)))
  (assignment (left_assignment_list (identifier) (rest_assignment (identifier))) (array (integer) (integer))))

==========
multiple assignment with multiple right hand sides
==========

x, y = foo, bar

---

(program (assignment
  (left_assignment_list (identifier) (identifier))
  (right_assignment_list (identifier) (identifier))))

==========
assignment from method call
==========

x = foo a, b

---

(program
  (assignment (identifier)
    (method_call (identifier)
      (argument_list (identifier) (identifier)))))

==========
math assignment
==========

x += y
x -= y
x *= y
x **= y
x /= y

---

(program
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier)))

==========
operator assignment
==========

x ||= y
x &&= y
x &= y
x |= y
x %= y
x >>= y
x <<= y

---

(program
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier))
  (operator_assignment (identifier) (identifier)))

===========
conditional
===========

a ? b : c

a ? b
  : c

---

(program
  (conditional (identifier) (identifier) (identifier))
  (conditional (identifier) (identifier) (identifier)))

===============
inclusive range
===============

a..b

---

(program (range (identifier) (identifier)))

===============
exclusive range
===============

a...b

---

(program (range (identifier) (identifier)))

==========
boolean or
==========

a || b

---

(program (binary (identifier) (identifier)))

===========
boolean and
===========

a && b

---

(program (binary (identifier) (identifier)))

==========
relational
==========

a == b
a != b
a === b
a <=> b
a =~ b
a !~ b

---

(program
  (binary (identifier) (identifier))
  (binary (identifier) (identifier))
  (binary (identifier) (identifier))
  (binary (identifier) (identifier))
  (binary (identifier) (identifier))
  (binary (identifier) (identifier)))

==========
comparison
==========

a < b
a <= b
a > b
a >= b

---

(program
  (binary (identifier) (identifier))
  (binary (identifier) (identifier))
  (binary (identifier) (identifier))
  (binary (identifier) (identifier)))

==========
bitwise or
==========

a | b

---

(program (binary (identifier) (identifier)))

===========
bitwise xor
===========

a ^ b

---

(program (binary (identifier) (identifier)))

===========
bitwise and
===========

a & b

---

(program (binary (identifier) (identifier)))

=====
shift
=====

a >> b
a << b

---

(program
  (binary (identifier) (identifier))
  (binary (identifier) (identifier)))

========
additive
========

a + b

---

(program (binary (identifier) (identifier)))

==============
multiplicative
==============

a * b

---

(program (binary (identifier) (identifier)))

===========
unary minus
===========

-a

---

(program (unary (identifier)))

===========
exponential
===========

a ** b

---

(program (binary (identifier) (identifier)))

==========
complement
==========

!a

---

(program (unary (identifier)))

===============================
method call
===============================

foo
foo()
print "hello"
print("hello")

---

(program
  (identifier)
  (method_call (identifier) (argument_list))
  (method_call (identifier) (argument_list (string)))
  (method_call (identifier) (argument_list (string))))

===============================
method call with arguments on multiple lines
===============================

foo a,
  b, c

---

(program
  (method_call
    (identifier)
    (argument_list (identifier) (identifier) (identifier))))

===============================
method call with training comma
===============================

foo(a, b,)

---

(program
  (method_call
    (identifier)
    (argument_list (identifier) (identifier))))

===============================
method call with receiver
===============================

foo.bar
foo.bar()
foo.bar "hi"
foo.bar "hi", 2
foo.bar("hi")
foo.bar("hi", 2)

---

(program
  (call (identifier) (identifier))
  (method_call (call (identifier) (identifier)) (argument_list))
  (method_call (call (identifier) (identifier)) (argument_list (string)))
  (method_call (call (identifier) (identifier)) (argument_list (string) (integer)))
  (method_call (call (identifier) (identifier)) (argument_list (string)))
  (method_call (call (identifier) (identifier)) (argument_list (string) (integer))))

===============================
method call with safe navigation operator
===============================

foo&.bar

---

(program (call (identifier) (identifier)))

===============================
method call with hash args
===============================

foo(:a => true)
foo([] => 1)
foo(bar => 1)
foo :a => true, :c => 1

---

(program
  (method_call (identifier) (argument_list (pair (symbol) (boolean))))
  (method_call (identifier) (argument_list (pair (array) (integer))))
  (method_call (identifier) (argument_list (pair (identifier) (integer))))
  (method_call (identifier) (argument_list (pair (symbol) (boolean)) (pair (symbol) (integer)))))

===============================
method call with keyword args
===============================

foo(a: true)
foo a: true

---

(program
  (method_call (identifier) (argument_list (pair (identifier) (boolean))))
  (method_call (identifier) (argument_list (pair (identifier) (boolean)))))

===============================
method call with block argument
===============================

foo(&:sort)
foo(&bar)

---

(program
  (method_call (identifier) (argument_list (block_argument (symbol))))
  (method_call (identifier) (argument_list (block_argument (identifier)))))

===============================
method call lambda argument
===============================

foo :bar, -> (a) { 1 }
foo :bar, -> (a) { where(:c => b) }

---

(program
  (method_call (identifier)
    (argument_list
      (symbol)
      (lambda (formal_parameters (identifier)) (integer))))
  (method_call (identifier)
    (argument_list
      (symbol)
      (lambda
        (formal_parameters (identifier))
        (method_call (identifier) (argument_list (pair (symbol) (identifier))))))))

===============================
method call lambda argument and do block
===============================

foo :bar, -> (a) { 1 } do
end

---

(program
  (method_call (identifier)
    (argument_list (symbol) (lambda (formal_parameters (identifier)) (integer)))
    (do_block)))

===============================
method calls with rest argument
===============================

foo(*bar)
foo(x, *bar)
foo(*bar.baz)

---

(program
  (method_call (identifier) (argument_list (rest_argument (identifier))))
  (method_call (identifier) (argument_list (identifier) (rest_argument (identifier))))
  (method_call (identifier) (argument_list (rest_argument (call (identifier) (identifier))))))

============================
method call without parens
============================

include D::E.f

---

(program (method_call (identifier) (argument_list (call (scope_resolution (identifier) (identifier)) (identifier)))))

============================
method call with line break
============================

Foo
  .bar
  .baz

Foo \
  .bar

---

(program
  (call (call (identifier) (identifier)) (identifier))
  (call (identifier) (identifier)))

===============================
method call with block argument do end
===============================

foo do |i|
  foo
end

foo(a) do |i|
  foo
end

foo.bar a do |i|
  foo
end

foo(a) do |name: i, *args|
end

---

(program
  (method_call
    (identifier)
    (do_block (formal_parameters (identifier)) (identifier)))
  (method_call
    (identifier)
    (argument_list (identifier))
    (do_block (formal_parameters (identifier)) (identifier)))
  (method_call
    (call (identifier) (identifier))
    (argument_list (identifier))
    (do_block (formal_parameters (identifier)) (identifier)))
  (method_call
    (identifier)
    (argument_list (identifier))
    (do_block (formal_parameters (keyword_parameter (identifier) (identifier)) (splat_parameter (identifier))))))

===============================
method call with block argument curly
===============================

foo { |i| foo }
foo items.any? { |i| i > 0 }
foo(bar, baz) { quux }

---

(program
  (method_call (identifier) (block (formal_parameters (identifier)) (identifier)))
  (method_call (identifier) (argument_list (method_call
    (call (identifier) (identifier))
    (block (formal_parameters (identifier)) (binary (identifier) (integer))))))

  (method_call
    (identifier)
    (argument_list (identifier) (identifier))
    (block (identifier))))

===============================
method call with block shadow arguments
===============================

foo { |; i, j| }

---

(program (method_call (identifier) (block (identifier) (identifier))))

===============================
method call with array arguments
===============================

foo []
foo [1]
foo[1]

---

(program
  (method_call (identifier) (argument_list (array)))
  (method_call (identifier) (argument_list (array (integer))))
  (element_reference (identifier) (integer)))

==============
empty lambda expression
==============

lambda {}

---

(program (lambda))

==================
lambda expression with body
==================

lambda { foo }

---

(program (lambda (identifier)))

====================
lambda expression with an arg
====================

lambda { |foo| 1 }

---

(program (lambda (formal_parameters (identifier)) (integer)))

===========================
lambda expression with multiple args
===========================

lambda { |a, b, c|
	1
	2
}

---

(program (lambda (formal_parameters (identifier) (identifier) (identifier)) (integer) (integer)))

====================
lambda expression with do end
====================

lambda do |foo|
  1
end

---

(program (lambda (formal_parameters (identifier)) (integer)))

===============================
backslash-newline as line continuation
===============================

foo \
  a, b

"abc \
de"

foo \
  "abc"

---

(program
  (method_call
    (identifier)
    (argument_list (identifier) (identifier)))
  (string)
  (method_call
    (identifier)
    (argument_list (string))))

===============================
basic division
===============================

10 / 5

---

(program (binary (integer) (integer)))

===============================
regex as parameter
===============================

foo /bar/

---

(program
  (method_call (identifier) (argument_list (regex))))

===============================
regex with opening space
===============================

foo
/ bar/

---

(program (identifier) (regex))

===============================
forward slash operator as method
===============================

Foo / "bar"
"/edit"

---

(program (binary (identifier) (string)) (string))

===============================
multiline regex
===============================

/ a
  b/

---

(program (regex))
